tutorials/fluids/dbnsDyMFluid/newShockTube/water/shockTube_2ndOrder/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue p 0.1e6
    volVectorFieldValue U (0 0 0)
    volScalarFieldValue T 300
);

regions
(
    boxToCell
    {
        box (0 0 0) (2.0 0.1 0.1);

        fieldValues
        (
            volScalarFieldValue p 1e6
        );
    }
);

// ************************************************************************* //
